{
  "diffs": [
    {
      "diff_id": "diff_001",
      "component_type": "CalculatedColumn",
      "component_name": "SALES_COMM_PAID_DATE",
      "file_path": "RSR Commissions Pre Prod v4.SemanticModel/definition/tables/FACT_EQUIPMENT_SALES_RPO_CONTRACT_RSR_SALES.tmdl",
      "status": "Modified",
      "main_version_code": "if [INVOICE_PAYMENT_INDICATOR] = \"Y\" and [INVOICE_PAYMENT_CLEAR_DATE] <= [SALES_ELIGIBILITY_DATE] then\n    Date.ToText([SALES_ELIGIBILITY_DATE], [Format = \"%M/%d/yyyy\"])\nelse if [INVOICE_PAYMENT_INDICATOR] = \"Y\" and [INVOICE_PAYMENT_CLEAR_DATE] > [SALES_ELIGIBILITY_DATE] then\n    fxCommissionFreezeDate([INVOICE_PAYMENT_CLEAR_DATE])",
      "comparison_version_code": "else if [INVOICE_PAYMENT_INDICATOR] = \"Y\" and [INVOICE_PAYMENT_CLEAR_DATE] < [SALES_ELIGIBILITY_DATE] then\n    Date.ToText([SALES_ELIGIBILITY_DATE], [Format = \"%M/%d/yyyy\"])\nelse if [INVOICE_PAYMENT_INDICATOR] = \"Y\" and [INVOICE_PAYMENT_CLEAR_DATE] >= [SALES_ELIGIBILITY_DATE] then\n    fxCommissionFreezeDate([INVOICE_PAYMENT_CLEAR_DATE])",
      "metadata": {
        "parent_table": "FACT_EQUIPMENT_SALES_RPO_CONTRACT_RSR_SALES",
        "description": "Calculated column that determines the commission paid date for machine sales"
      },
      "relevance_reason": "This changes when machine sales commissions are paid in the payroll cycle when invoice payment clears exactly on the eligibility date",
      "business_impact": {
        "what_changed": "The rule for determining commission payment timing when a customer payment clears on the exact same day as the commission eligibility date. Main v4 treats 'same day' payments as 'early' payments, while Comparison v3 treats them as 'on time or late' payments.",
        "who_affected": "Sales representatives whose customers pay invoices on the exact commission eligibility freeze date (e.g., payment clears on the 5th of the month when that's also the eligibility date). This is likely a small subset of transactions but creates inconsistent treatment of edge cases.",
        "timing_impact": "When payment clears exactly on the eligibility date:\n- Main v4: Commission is paid in the CURRENT eligibility period (same month as eligibility date)\n- Comparison v3: Commission is delayed to the NEXT freeze date cycle (following month)\n\nExample: If eligibility date is May 5th and payment clears May 5th:\n- v4 pays commission: May 5th\n- v3 pays commission: June 5th (30-day delay)",
        "financial_impact": "Main v4 accelerates commission payments by approximately 30 days for exact-match scenarios, improving sales rep cash flow. Comparison v3 delays these payments by one full commission cycle, creating a potential 30-day working capital benefit for the company but dissatisfaction for sales reps who met the deadline exactly.",
        "choose_main_v4_if": "You want to reward sales reps when customers pay on or before the eligibility deadline (inclusive, sales-rep-friendly interpretation). This treats 'on the deadline' as meeting the requirement. Choose this if your culture emphasizes meeting deadlines as sufficient and you want faster commission payouts.",
        "choose_comparison_v3_if": "You want stricter payment timing requirements where only early payments (before the eligibility date) qualify for the current cycle. This provides more conservative financial management and creates a buffer. Choose this if you prefer payments must clear BEFORE the deadline to count for the current period.",
        "recommendation": "Main v4 is recommended. The standard business interpretation of 'by the 5th' includes the 5th itself (<=). This aligns with common payroll and deadline practices. The v3 logic appears to be an edge case bug where the boundary condition was incorrectly implemented with separate < and >= conditions rather than <= and >."
      }
    }
  ]
}
